---
kind: method
id: M:Autodesk.Revit.DB.ExternalResourceLoadData.GetLoadContent
source: html/17491a3b-1bc7-161c-56e0-836c58537585.htm
---
# Autodesk.Revit.DB.ExternalResourceLoadData.GetLoadContent Method

Returns the ExternalResourceLoadContent resulting from this load operation.

## Syntax (C#)
```csharp
public ExternalResourceLoadContent GetLoadContent()
```

## Returns
A reference to an ExternalResourceLoadContent object.

## Remarks
This object contains the content produced by the call to the IExternalResourceServer's
 LoadResource method.